colzin/nrf52_wheelLine_accel/nRF52_wheelLine_accel_SDK17/wheelLineRemote_FW/src/cc1101.c
} mdmcfg2_syncMode_t;

#define MDMCFG1_REGADDR         0x13        // Modem configuration
#define MDMCFG1_FEC_EN          0x80 // b7 set to enable forward Error Correction (FEC)
#define MDMCFG1_NUM_PREAMBLE(x) ((x<<4)&0x70) // b6:4 set min num preamble bytes to transmit
typedef enum
{
    preambleBytes_2 = 0,
    preambleBytes_3,
    preambleBytes_4,
    preambleBytes_6,
    preambleBytes_8,
    preambleBytes_12,
    preambleBytes_16,
    preambleBytes_24
} mdmcfg1_numPreamBytes_t;
// b3:2 not used, read 0
#define MDMCFG1_CHANSPC_E(x)    (x&0x03) // b1:0 exponent of channel spacing

#define MDMCFG0_REGADDR         0x14        // Modem configuration
// b7:0 CHANSPC_Mantissa[7:0], see datasheet

#define DEVIATN_REGADDR         0x15        // Modem deviation setting
// b7 not used, reads 0
#define DEVIATN_EXP(x)          ((x<<4)&0x70) // b6:4 exponent of deviation
// b3 not used, reads 0
#define DEVIATN_MANTISSA(x)     (x&0x07) // See datasheet for different uses depending on modulation format

#define MCSM2_REGADDR           0x16        // Main Radio Control State Machine config
// b7:5 not used
#define MCSM2_RX_TIME_RSSI      0x10 // Direct RX termination based on RSSI if set.
#define MCSM2_RX_TIME_QUAL      0x08 // check if sync word is found if set
#define MCSM2_RX_TIME(x)        (x&0x07) // See datasheet

#define MCSM1_REGADDR           0x17        // Main Radio Control State Machine config
// b7:6 not used, read 0
#define MCSM1_CCA_MODE(x)       ((x<<4)&0x30) // b5:4 CCA mode
typedef enum
{
    ccaMode_always = 0,
    ccaMode_RssiBelowThreshold,
    ccaMode_ulessReceiving,
    ccaMode_RssiBelowThresholdUnlessRx
} mcsm1_ccaMode_t;
#define MCSM1_RXOFF_MODE(x)     ((x<<2)&0xC0) // b3:2 rxoff_mode
typedef enum
{ // What to do once a packet has been received
    rxOff_idle = 0,
    rxOff_fstxon,
    rxOff_Tx,
    rxOff_stayInRx
} mcsm1_rxoffMode_t;
#define MCSM1_TXOFF_MODE(x)     (x&0x03)
typedef enum
{ // What to do once TX is done sending a packet
    txOff_idle = 0,
    txOff_fstxon,
    txOff_stayInTx, // Start sending another preamble
    txOff_Rx
} mcsm1_txoffMode_t;

#define MCSM0_REGADDR           0x18        // Main Radio Control State Machine config
// b7:6 not used, read 0
#define MCSM0_FS_AUTOCAL(x)     ((x<<4)&0x30) // b5:4 auto-cal when going to RX or TX
typedef enum
{
    fsAutocal_never = 0,
    faAutocal_idleToRxOrTx,
    fsAutocal_RxOrTxToIdle,
    fsAutocal_every4thRxOrTxToIdle
} mcsm0_fsAutocal_t;
#define MCSM0_PO_TIMEOUT(x)     ((x<<2)&0xC0) // b3:2 POWER-ON timeout
typedef enum
{
    poTimeout_1count = 0,
    poTimeout_16counts,
    poTimeout_64counts,
    poTimeout_256counts
} mcsm0_poTimeout_t;
#define MCSM0_PIN_CTRL_EN       0x02 // b1 set enables the pin radio control option
#define MCSM0_XOSC_FORCE_ON     0x01 // b0 set forces XOSC to stay on in SLEEP state

#define FOCCFG_REGADDR          0x19        // Frequency Offset Compensation config
// b7:6 not used, read 0
// b5 FOC_BS_CS_GATE
// b4:3 FOC_PRE_K[1:0]
// b2 FOC_POST_K
// b1:0 FOC_LIMIT[1:0]

#define BSCFG_REGADDR           0x1A        // Bit Synchronization configuration

#define AGCCTRL2_REGADDR        0x1B        // AGC control
#define AGCCTRL2_MAX_DVGA_GAIN(x)   ((x<<6)&0xC0) // b7:6 max_dvga_gain[1:0]
#define AGCCTRL2_MAX_LNA_GAIN(x)    ((x<<3)&0x38) // 5:3 max_lna_gain[2:0]
#define AGCCTRL2_MAGN_TARGET(x)     (x&0x07) // b2:0 MAGN_TARGET[2:0]

#define AGCCTRL1_REGADDR        0x1C        // AGC control
// b7 not used, reads 0
#define AGCCTRL1_AGC_LNA_PRIO       0x40 // b6 selects LNA/2 strategies.
#define AGCCTRL1_CSENSE_REL_THR(x)  ((x<<4)&0x30) // b5:4 set relative change threshold for asserting carrier sense
typedef enum
{
    csense_relThresholdDisabled = 0,
    csense_6dBincrease,
    csense_10dBincrease,
    csense_14dBincrease
} agcctrl1_csenseRelThr_t;
#define AGCCTRL1_CSENSE_ABS_THR(x)  (x&0x0F) // b3:0 set absolute threshold for asserting Csense, 2s-complement 4-bit
// See datasheet

#define AGCCTRL0_REGADDR        0x1D        // AGC control
// See datasheet

#define WOREVT1_REGADDR         0x1E        // High byte Event 0 timeout
#define WOREVT0_REGADDR         0x1F        // Low byte Event 0 timeout

#define WORCTRL_REGADDR         0x20        // Wake On Radio control

#define FREND1_REGADDR          0x21        // Front end RX configuration

#define FREND0_REGADDR          0x22        // Front end TX configuration

#define FSCAL3_REGADDR          0x23        // Frequency synthesizer calibration

#define FSCAL2_REGADDR          0x24        // Frequency synthesizer calibration

#define FSCAL1_REGADDR          0x25        // Frequency synthesizer calibration

#define FSCAL0_REGADDR          0x26        // Frequency synthesizer calibration

#define RCCTRL1_REGADDR         0x27        // RC oscillator configuration

#define RCCTRL0_REGADDR         0x28        // RC oscillator configuration

#define FSTEST_REGADDR          0x29        // Frequency synthesizer cal control

#define PTEST_REGADDR           0x2A        // Production test

#define AGCTEST_REGADDR         0x2B        // AGC test

#define TEST2_REGADDR           0x2C        // Various test settings
#define TEST1_REGADDR           0x2D        // Various test settings
#define TEST0_REGADDR           0x2E        // Various test settings

// Strobe commands
#define STROBE_SRES         0x30        // Reset chip.
#define STROBE_SFSTXON      0x31        // Enable/calibrate freq synthesizer
#define STROBE_SXOFF        0x32        // Turn off crystal oscillator.
#define STROBE_SCAL         0x33        // Calibrate freq synthesizer & disable
#define STROBE_SRX          0x34        // Enable RX.
#define STROBE_STX          0x35        // Enable TX.
#define STROBE_SIDLE        0x36        // Exit RX / TX
//#define STROBE_SAFC       0x37        // AFC adjustment of freq synthesizer
#define STROBE_STARTWOR     0x38        // Start automatic RX polling sequence (Wake on Radio)
#define STROBE_POWERDOWN    0x39        // Enter pwr down mode when CSn goes hi
#define STROBE_FLUSHRXFIFO  0x3A        // Flush the RX FIFO buffer. Can only do this in IDLE or RXOVF states
#define STROBE_FLUSHTXFIFO  0x3B        // Flush the TX FIFO buffer. Can only do this in IDLE or TXUVF states
#define STROBE_RESETRTC     0x3C        // Reset real time clock to event1 value
#define STROBE_NOP          0x3D        // No operation.

