colzin/nrf52_wheelLine_accel/nRF52_wheelLine_accel_SDK17/wheelLineRemote_FW/src/cc1101.c
// Other memory locations
#define PATABLE_REGADDR      0x3E // Must read or write PATABLE bytes 0:7 in burst read or write
#define TXFIFO_REGADDR       0x3F // Access in burst to read multiple bytes
#define RXFIFO_REGADDR       0x3F // Access in burst to read multiple bytes

// Status registers (need burst mode set)
#define PARTNUM_REGADDR         0xF0        // b7:0 should be 0x00 for part number
#define VERSION_REGADDR         0xF1        // b7:0 are 0x14 maybe, Current version number
#define FREQEST_REGADDR         0xF2        // Frequency offset estimate

#define LQI_REGADDR             0xF3        // Demodulator estimate for link quality
#define LQI_CRC_OK          0x80 // b7 set if last CRC comparison matched.
#define LQI_LQI_EST(x)      (x&0x7F) // b6:0 link quality indicator calculated over first 64 packet bytes

#define RSSI_REGADDR            0xF4        // b7:0 are Received signal strength indication
#define MARCSTATE_REGADDR       0xF5        // Main Radio Control state machine state
// b7:5 not used, read 0
typedef enum
{
    marcState_sleep = 0,
    marcState_idle,
    marcState_xoff,
    marcState_vcoon_mc,
    marcState_regon_mc,
    marcState_mancal,
    marcState_VCOon,
    marcState_regon,
    marcState_startcal,
    marcState_bwboost,
    marcState_fs_lock,
    marcState_ifadcon,
    marcState_endcal,
    marcState_rx,
    marcState_rx_end,
    marcState_rx_rst,
    marcState_txrx_switch,
    marcState_rxfifo_overflow,
    marcState_fstxon,
    marcState_tx,
    marcState_tx_end,
    marcState_rxtx_switch,
    marcState_txfifo_underflow
} marcState_state_t;
#define WORTIME1_REGADDR        0xF6        // High byte of WOR timer
#define WORTIME0_REGADDR        0xF7        // Low byte of WOR timer

#define PKTSTATUS_REGADDR       0xF8        // Current GDOx status and packet status
#define PKTSTATUS_CRC_OK        0x80 // b7 set if last CRC matched
#define PKTSTATUS_CS            0x40 // b6 Carrier sense. Cleared when entering idle
#define PKTSTATUS_PQT_REACHED   0x20 // b5 set if Preamble Quality is reached.
#define PKTSTATUS_CCA           0x10 // b4 set if channel is clear
#define PKTSTATUS_SFD           0x08 // b3 set start of Frame Delimiter, sync word has been received
#define PKTSTATUS_GDO2          0x04 // b2 set if GDO2 is active (non-inverted)
// b1 not used, reads 0
#define PKTSTATUS_GDO0          0x01 // b0 set if GDO2 is active (non-inverted)

#define VCO_VC_DAC_REGADDR      0xF9        // Test only: Current setting from PLL cal module

#define TXBYTES_REGADDR         0xFA        // Underflow and # of bytes in TXFIFO
#define TXBYTES_UNDERFLOW   0x80 // b7 set if underflow in TX register
#define TXBYTES_NUM(x)      (x&0x7F) // b6:0 num bytes in TX FIFO

#define RXBYTES_REGADDR         0xFB        // Overflow and # of bytes in RXFIFO
#define RXBYTES_OVERFLOW    0x80 // b7 set if RXoverflowed FIFO
#define RXBYTES_NUM(x)      (x&0x7F) // b6:0 num bytes in RX FIFO

#define RCCTRL1_STATUS_REGADDR  0xFC    // RC oscillator cal routine result.
#define RCCTRL0_STATUS_REGADDR  0xFD    // RC oscillator cal routine result.

// Masks for appended status bytes
#define CC1101_RSSI_RX        0x00        // Position of LQI byte
#define CC1101_LQI_RX         0x01        // Position of LQI byte
#define CC1101_CRC_OK         0x80        // Mask "CRC_OK" bit within LQI byte
#define CC1101_NUM_RXBYTES    0x7F        // Mask "# of bytes" field in _RXBYTES
#define CC1101_MARCSTATE_IDLE 0x01        // The status register indicates idle

// Definitions to support burst/single access:
#define CC1101_WRITE_BURST  0x40
#define CC1101_READ_SINGLE  0x80
#define CC1101_READ_BURST   0xC0

#if COMPILE_FOR_PCA10040
#define TX_TEST_ITVL_MS  3000 // non-zero to run TX test poll
#else
#define TX_TEST_ITVL_MS  0 // non-zero to run TX test poll
#endif // #if COMPILE_FOR_PCA10040

#define PKT_SIZE_FIXED 1 // TODO switch to variable later to save power.
#if PKT_SIZE_FIXED
#define TEST_PKT_LEN 60
#else
#error "Define packet size or type"
#endif // #if PKT_SIZE_FIXED

#define RX_POLL_ITVL_MS 500 // Datasheet says not to spam SPI with traffic

typedef enum
{
    packetRxState_awaitingPacketStart,
    packetRxState_awaitingPacketBytes,
    packetRxState_receivedPacketBytes,
    packetRxState_awaitingRSSILQI,
    packetRxState_finishedWithPacket
} packetRxState_t;

typedef struct
{
    uint8_t* pPacket;
    uint32_t packetBufIndex, packetBufLen;
    bool readFromChip;
    pktCtrl0_lenCfg_t packetLenCfg;
    uint8_t expectedPacketLen;
    bool RSSIandLQIAppended;
    int8_t RSSI;
    uint8_t LQI;
    packetRxState_t rxState;

} packetRxSettings_t;

/*************************************************************************************
 *  Variables
 ************************************************************************************/

static uint8_t m_lastChipStatusByte;

#if TX_TEST_ITVL_MS
static uint32_t m_lastTx_ms;
#endif // #if TX_TEST_ITVL_MS

static uint32_t m_lastRxPoll_ms;

// For receiving packets
static uint8_t m_rxPacketBuffer[TEST_PKT_LEN];
static packetRxSettings_t m_rxSettings;

/*************************************************************************************
 *  Prototypes
 ************************************************************************************/

/*************************************************************************************
 *  Functions
 ************************************************************************************/

static void updateStatus(uint8_t newVal)
{

    if (CHIPSTATUSBYTE_STATE(m_lastChipStatusByte) != CHIPSTATUSBYTE_STATE(newVal))
    {
        NRF_LOG_DEBUG("Status from 0x%x to 0x%x", CHIPSTATUSBYTE_STATE(m_lastChipStatusByte),
                      CHIPSTATUSBYTE_STATE(newVal));
        m_lastChipStatusByte = newVal;
    }
}

static bool cc1101_readSingleByte(uint8_t address, uint8_t* pByte)
{
    // Just need the address byte for TX
    uint8_t txByte = (address | CC1101_READ_SINGLE);
    uint8_t rxBytes[2];
    // Send 1 byte, address
    nrfx_spi_xfer_desc_t xfer;
    xfer.p_rx_buffer = rxBytes;
    xfer.p_tx_buffer = &txByte;
    xfer.rx_length = 2;
    xfer.tx_length = 1;
    ret_code_t ret = spi0_xfer(spi0_cc1101, &xfer, false);
    updateStatus(rxBytes[0]);
//    NRF_LOG_INFO("Wrote 0x%x, read Status 0x%x, byte 0x%x", txByte, rxBytes[0], rxBytes[1]);
    *pByte = rxBytes[1];
    return ret == NRF_SUCCESS ? true : false;
}

// Command strobes are 1-byte addresses which trigger things
static bool cc1101_strobe(uint8_t address)
{
    // Send 1 byte, address to execute a task, read back the status reg
    uint8_t sres;
    nrfx_spi_xfer_desc_t xfer;
    xfer.p_rx_buffer = &sres;
    xfer.p_tx_buffer = &address;
    xfer.rx_length = 1;
    xfer.tx_length = 1;
    ret_code_t ret = spi0_xfer(spi0_cc1101, &xfer, false);
    updateStatus(sres);
//    NRF_LOG_INFO("Strobed 0x%x, read Status 0x%x", address, sres);
    return ret == NRF_SUCCESS ? true : false;
}

