colzin/nrf52_wheelLine_accel/nRF52_wheelLine_accel_SDK17/wheelLineRemote_FW/src/cc1101.c
static bool cc1101_writeSingleByte(uint8_t address, uint8_t data)
{
    uint8_t tx_data[2];
    tx_data[0] = address;
    tx_data[1] = data;
    uint8_t sres;
    nrfx_spi_xfer_desc_t xfer;
    xfer.p_rx_buffer = &sres;
    xfer.p_tx_buffer = tx_data;
    xfer.rx_length = 1;
    xfer.tx_length = 2;
    ret_code_t ret = spi0_xfer(spi0_cc1101, &xfer, false);
    updateStatus(sres);
//    NRF_LOG_INFO("Wrote address 0x%x to 0x%x, read Status 0x%x", address, data, sres);
    return ret == NRF_SUCCESS ? true : false;
}

static bool cc1101_writeBurst(uint8_t startAddress, uint8_t* data, uint32_t len)
{
    uint8_t buf = startAddress | CC1101_WRITE_BURST;
    ret_code_t ret = spi0_write(spi0_cc1101, &buf, 1, true);
    ret |= spi0_write(spi0_cc1101, data, len, false);
    return ret == NRF_SUCCESS ? true : false;
}

static bool cc1101_readBurst(uint8_t startAddress, uint8_t* buffer, uint32_t len)
{
    uint8_t buf = startAddress | CC1101_READ_BURST;
    ret_code_t ret = spi0_write(spi0_cc1101, &buf, 1, true);
    ret |= spi0_read(spi0_cc1101, buffer, len, false);
    return ret == NRF_SUCCESS ? true : false;
}

static bool cc1101_reboot(void)
{
    // Wait for it to boot. It will drive MISO low when we drive CS low, if it's ready
    uint32_t retries = 100;
//    uint32_t ms_timestamp = uptimeCounter_getUptimeMs();
    while (retries)
    { //  drive CS low, see if it responds by driving MISO low. Can do this by reading status byte
        cc1101_strobe(STROBE_NOP);
        if (m_lastChipStatusByte & 0x80)
        {
            // Else wait and try again
            nrf_delay_ms(1);
            retries--;
        }
        else
        {
//            NRF_LOG_INFO("Detected CC1101 ready after %d ms, %d retries left", uptimeCounter_elapsedSince(ms_timestamp),
//                         retries);
            break;
        }
    }
    if (!retries)
    {
        NRF_LOG_ERROR("Did not detect CC1101, retries exceeded");
        return false;
    }
//    NRF_LOG_INFO("Checking for CC1101 to be rebooted:");
    // Issue software reset
    bool ret = cc1101_strobe(STROBE_SRES);
    if (!ret)
    {
        NRF_LOG_WARNING("Failed to send strobe command");
    }
    // Wait for it to reboot. Datasheet says max of
    retries = 100;
//    ms_timestamp = uptimeCounter_getUptimeMs();
    while (retries)
    { //  drive CS low, see if it responds by driving MISO low. Can do this by reading status byte
        cc1101_strobe(STROBE_NOP);
        if (m_lastChipStatusByte & 0x80)
        {
            // Else wait and try again
            nrf_delay_ms(1);
            retries--;
        }
        else
        {
//            NRF_LOG_INFO("Detected CC1101 ready after %d ms, %d retries left", uptimeCounter_elapsedSince(ms_timestamp),
//                         retries);
            break;
        }
    }
    if (!retries)
    {
        NRF_LOG_ERROR("Did not detect CC1101, retries exceeded");
        return false;
    }
    return true;
}

static bool cc1101_selfTest(void)
{
    uint8_t partNum;
    uint8_t version;
    bool ret;

    // Read partNum and version registers
    ret = cc1101_readSingleByte(PARTNUM_REGADDR, &partNum);
    if (ret != true)
    {
        NRF_LOG_ERROR("Error reading PARTNUM");
        return false;
    }
    // CC1101 datasheet says partnum should be 0
    if (0 != partNum)
    {
        NRF_LOG_ERROR("Partnum is %d, expected 0", partNum);
        return false;
    }
    ret = cc1101_readSingleByte(VERSION_REGADDR, &version);
    if (ret != true)
    {
        NRF_LOG_ERROR("Error reading VERSION");
        return ret;
    }
    // Versions in the past have been 20 and 4. Datasheet says subject to change without notice.
    if (0 == version)
    {
        NRF_LOG_ERROR("Version was 0, is SPI set up right?");
        return false;
    }
    if (4 != version)
    {
        NRF_LOG_WARNING("Version is %d, expected %d", version, 4);
        // Continue
    }
    NRF_LOG_INFO("CC1101: Self Test Passed. Detected partnum %d, version %d, status 0x%x", partNum, version,
                 CHIPSTATUSBYTE_STATE(m_lastChipStatusByte));
    return true;

}

void cc1101_setIdle(bool flushFifos)
{
    uint8_t marcState;
    cc1101_strobe(STROBE_SIDLE); // Tell it to idle
    cc1101_readSingleByte(MARCSTATE_REGADDR, &marcState);
    while (marcState_idle != marcState)
    {
        nrf_delay_us(100);
        cc1101_readSingleByte(MARCSTATE_REGADDR, &marcState);
    }
    if (flushFifos)
    {
        cc1101_strobe(STROBE_FLUSHTXFIFO); // Can flush in idle
        cc1101_strobe(STROBE_FLUSHRXFIFO); // Can flush in idle
    }
//    nrf_delay_us(100);
}

// From TI studio Nov 13, 2023 for 3kBaud at 433MHz ASK
static void cc1101_initASKTx_myStudio(void)
{
    cc1101_writeSingleByte(IOCFG2_REGADDR, 0x29);
    cc1101_writeSingleByte(IOCFG1_REGADDR, 0x2e);
//    cc1101_writeSingleByte(IOCFG0, 0x06);
    cc1101_writeSingleByte(IOCFG0_REGADDR, 0x3F);
    cc1101_writeSingleByte(FIFOTHR_REGADDR, 0x07); // TODO is this what we want?
    cc1101_writeSingleByte(SYNC1_REGADDR, 0xd3);
    cc1101_writeSingleByte(SYNC0_REGADDR, 0x91);
//    cc1101_writeSingleByte(PKTLEN, 0xff);
    cc1101_writeSingleByte(PKTLEN_REGADDR, 0x10);
    cc1101_writeSingleByte(PKTCTRL1_REGADDR, 0x04);
    cc1101_writeSingleByte(PKTCTRL0_REGADDR, 0x05);
    cc1101_writeSingleByte(PKTCTRL0_REGADDR, 0x04);
    cc1101_writeSingleByte(ADDR_REGADDR, 0x00);
    cc1101_writeSingleByte(CHANNR_REGADDR, 0x00);
//    cc1101_writeSingleByte(FSCTRL1_REGADDR, 0x06);
    cc1101_writeSingleByte(FSCTRL1_REGADDR, 0x0F);
    cc1101_writeSingleByte(FSCTRL0_REGADDR, 0x00);
    cc1101_writeSingleByte(FREQ2_REGADDR, 0x10);
//    cc1101_writeSingleByte(FREQ1_REGADDR, 0xA7);
    cc1101_writeSingleByte(FREQ1_REGADDR, 0xA8);
//    cc1101_writeSingleByte(FREQ0_REGADDR, 0x62);
    cc1101_writeSingleByte(FREQ0_REGADDR, 0x5E);
//    cc1101_writeSingleByte(MDMCFG4_REGADDR, 0xF6);
    cc1101_writeSingleByte(MDMCFG4_REGADDR, 0x86);
    cc1101_writeSingleByte(MDMCFG3_REGADDR, 0xE4);
//    cc1101_writeSingleByte(MDMCFG2_REGADDR, 0x37);
    cc1101_writeSingleByte(MDMCFG2_REGADDR, 0x30);
//    cc1101_writeSingleByte(MDMCFG1_REGADDR, 0x00);
    cc1101_writeSingleByte(MDMCFG1_REGADDR, 0x02);
    cc1101_writeSingleByte(MDMCFG0_REGADDR, 0xF8);
    cc1101_writeSingleByte(DEVIATN_REGADDR, 0x47);
    cc1101_writeSingleByte(MCSM2_REGADDR, 0x07);
    cc1101_writeSingleByte(MCSM1_REGADDR, 0x30);
//    cc1101_writeSingleByte(MCSM0_REGADDR, 0x18);
    cc1101_writeSingleByte(MCSM0_REGADDR, 0x04);
//    cc1101_writeSingleByte(FOCCFG_REGADDR, 0x16);
    cc1101_writeSingleByte(FOCCFG_REGADDR, 0x36);
    cc1101_writeSingleByte(BSCFG_REGADDR, 0x6C);
    cc1101_writeSingleByte(AGCCTRL2_REGADDR, 0x03);
    cc1101_writeSingleByte(AGCCTRL1_REGADDR, 0x40);
    cc1101_writeSingleByte(AGCCTRL0_REGADDR, 0x91);
    cc1101_writeSingleByte(WOREVT1_REGADDR, 0x87);
    cc1101_writeSingleByte(WOREVT0_REGADDR, 0x6B);
    cc1101_writeSingleByte(WORCTRL_REGADDR, 0xF8);
    cc1101_writeSingleByte(FREND1_REGADDR, 0x56);
    cc1101_writeSingleByte(FREND0_REGADDR, 0x11);
    cc1101_writeSingleByte(FSCAL3_REGADDR, 0xE9);
    cc1101_writeSingleByte(FSCAL2_REGADDR, 0x2A);
    cc1101_writeSingleByte(FSCAL1_REGADDR, 0x00);
    cc1101_writeSingleByte(FSCAL0_REGADDR, 0x1F);
    cc1101_writeSingleByte(RCCTRL1_REGADDR, 0x41);
    cc1101_writeSingleByte(RCCTRL0_REGADDR, 0x00);
    cc1101_writeSingleByte(FSTEST_REGADDR, 0x59);
    cc1101_writeSingleByte(PTEST_REGADDR, 0x7F);
    cc1101_writeSingleByte(AGCTEST_REGADDR, 0x3F);
//    cc1101_writeSingleByte(TEST2_REGADDR, 0x81);
    cc1101_writeSingleByte(TEST2_REGADDR, 0x88);
//    cc1101_writeSingleByte(TEST1_REGADDR, 0x35);
    cc1101_writeSingleByte(TEST1_REGADDR, 0x31);
    cc1101_writeSingleByte(TEST0_REGADDR, 0x09);
    uint8_t paTableBytes[8] = { 0x00, 0x60, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 };
    cc1101_writeBurst(PATABLE_REGADDR, paTableBytes, 8);

    // TODO customize IO pins
//    cc1101_writeSingleByte(IOCFG2, 0x0B);     //serial clock.synchronous to the data in synchronous serial mode
//        cc1101_writeSingleByte(IOCFG0, 0x06); //asserts when sync word has been sent/received, and de-asserts at the end of the packet

    cc1101_setIdle(true);
//    cc1101_flushTxFifo();
//    cc1101_flushRxFifo();
}

static void setupFeb6(void)
{
    if (statusByteState_idle != CHIPSTATUSBYTE_STATE(m_lastChipStatusByte))
    {
        NRF_LOG_DEBUG("CC1101 in state %d, not idle, go to idle:", CHIPSTATUSBYTE_STATE(m_lastChipStatusByte));
        cc1101_setIdle(true); // Idle it before writing configs
    }

    /* Rf settings for CC1101, exported Feb 06, 2024
     *432.99MHz, XTAL 26MHz
     */
//    cc1101_writeSingleByte(IOCFG0_REGADDR, 0x06);  //GDO0 Output Pin Configuration
    cc1101_writeSingleByte(IOCFG2_REGADDR, IOCFGx_GDOx_CFG(gdox_3state));
    cc1101_writeSingleByte(IOCFG1_REGADDR, IOCFGx_GDOx_CFG(gdox_3state));
    cc1101_writeSingleByte(IOCFG0_REGADDR, IOCFGx_GDOx_CFG(gdox_3state));

