colzin/nrf52_wheelLine_accel/nRF52_wheelLine_accel_SDK17/wheelLineRemote_FW/src/cc1101.c
    cc1101_writeSingleByte(FIFOTHR_REGADDR, 0x47); //RX FIFO and TX FIFO Thresholds

    //    cc1101_writeSingleByte(PKTCTRL0_REGADDR, 0x05); //Packet Automation Control
    cc1101_writeSingleByte(PKTCTRL1_REGADDR, PKTCTRL1_APPEND_STATUS | PKTCTRL1_ADDR_CHK(addrChk_none));
#if PKT_SIZE_FIXED
//    regByte | = TODO CRC, maybe whitening
    cc1101_writeSingleByte(PKTCTRL0_REGADDR, PKTCTRL0_LENGTH_CFG(pktLen_fixed)); //Packet Automation Control
    cc1101_writeSingleByte(PKTLEN_REGADDR, TEST_PKT_LEN);
#else
#error "define"
#endif // Eif PKT_SIZE_FIXED
    cc1101_writeSingleByte(FSCTRL1_REGADDR, 0x06); //Frequency Synthesizer Control
    cc1101_writeSingleByte(FREQ2_REGADDR, 0x10);   //Frequency Control Word_REGADDR, High Byte
    cc1101_writeSingleByte(FREQ1_REGADDR, 0xA7);   //Frequency Control Word_REGADDR, Middle Byte
    cc1101_writeSingleByte(FREQ0_REGADDR, 0x62);   //Frequency Control Word_REGADDR, Low Byte
    cc1101_writeSingleByte(MDMCFG4_REGADDR, 0xF5); //Modem Configuration
    cc1101_writeSingleByte(MDMCFG3_REGADDR, 0x83); //Modem Configuration
    cc1101_writeSingleByte(MDMCFG2_REGADDR, 0x33); //Modem Configuration
    cc1101_writeSingleByte(DEVIATN_REGADDR, 0x15); //Modem Deviation Setting
    cc1101_writeSingleByte(MCSM0_REGADDR, 0x18);   //Main Radio Control State Machine Configuration
    cc1101_writeSingleByte(FOCCFG_REGADDR, 0x14);  //Frequency Offset Compensation Configuration
    cc1101_writeSingleByte(AGCCTRL0_REGADDR, 0x92);  //AGC Control
    cc1101_writeSingleByte(WORCTRL_REGADDR, 0xFB); //Wake On Radio Control
    cc1101_writeSingleByte(FREND0_REGADDR, 0x11);  //Front End TX Configuration
    cc1101_writeSingleByte(FSCAL3_REGADDR, 0xE9);  //Frequency Synthesizer Calibration
    cc1101_writeSingleByte(FSCAL2_REGADDR, 0x2A);  //Frequency Synthesizer Calibration
    cc1101_writeSingleByte(FSCAL1_REGADDR, 0x00);  //Frequency Synthesizer Calibration
    cc1101_writeSingleByte(FSCAL0_REGADDR, 0x1F);  //Frequency Synthesizer Calibration
    cc1101_writeSingleByte(TEST2_REGADDR, 0x81);   //Various Test Settings
    cc1101_writeSingleByte(TEST1_REGADDR, 0x35);   //Various Test Settings
    cc1101_writeSingleByte(TEST0_REGADDR, 0x09);   //Various Test Settings
    uint8_t paTableBytes[8] = { 0x00, 0x1D, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 };
    cc1101_writeBurst(PATABLE_REGADDR, paTableBytes, 8);

    NRF_LOG_WARNING("CC1101 feb 6 COMPLETE");
}

/* Packet sniffer settings Feb 06 2024
 # ---------------------------------------------------
 # Packet sniffer stttings for CC1101
 # ---------------------------------------------------
 IOCFG0   |0x0002|0x06|GDO0 Output Pin Configuration
 FIFOTHR  |0x0003|0x47|RX FIFO and TX FIFO Thresholds
 PKTCTRL0 |0x0008|0x05|Packet Automation Control
 FSCTRL1  |0x000B|0x06|Frequency Synthesizer Control
 FREQ2    |0x000D|0x10|Frequency Control Word, High Byte
 FREQ1    |0x000E|0xA7|Frequency Control Word, Middle Byte
 FREQ0    |0x000F|0x62|Frequency Control Word, Low Byte
 MDMCFG4  |0x0010|0xF5|Modem Configuration
 MDMCFG3  |0x0011|0x83|Modem Configuration
 MDMCFG2  |0x0012|0x33|Modem Configuration
 DEVIATN  |0x0015|0x15|Modem Deviation Setting
 MCSM0    |0x0018|0x18|Main Radio Control State Machine Configuration
 FOCCFG   |0x0019|0x14|Frequency Offset Compensation Configuration
 AGCCTRL0 |0x001D|0x92|AGC Control
 WORCTRL  |0x0020|0xFB|Wake On Radio Control
 FREND0   |0x0022|0x11|Front End TX Configuration
 FSCAL3   |0x0023|0xE9|Frequency Synthesizer Calibration
 FSCAL2   |0x0024|0x2A|Frequency Synthesizer Calibration
 FSCAL1   |0x0025|0x00|Frequency Synthesizer Calibration
 FSCAL0   |0x0026|0x1F|Frequency Synthesizer Calibration
 TEST2    |0x002C|0x81|Various Test Settings
 TEST1    |0x002D|0x35|Various Test Settings
 TEST0    |0x002E|0x09|Various Test Settings
 */

static void readInSettings(packetRxSettings_t* pSettings)
{
    uint8_t regByte;
    // Read the packet length config
    cc1101_readSingleByte(PKTCTRL0_REGADDR, &regByte);
    pSettings->packetLenCfg = PKTCTRL0_LENGTH_CFG(regByte);
    // Read whether the RSSI and LQI are appended
    cc1101_readSingleByte(PKTCTRL1_REGADDR, &regByte);
    if (regByte & PKTCTRL1_APPEND_STATUS)
    {
        pSettings->RSSIandLQIAppended = true;
        NRF_LOG_DEBUG("Read in settings: Expect appended RSSI and LQI");
    }
    if (pktLen_fixed == pSettings->packetLenCfg)
    { // Read expected packet length
        cc1101_readSingleByte(PKTLEN_REGADDR, &pSettings->expectedPacketLen);
        NRF_LOG_DEBUG("Read in settings: Fixed packet len of %d", pSettings->expectedPacketLen);
    }
    else if (pktLen_variable == pSettings->packetLenCfg)
    { // Read in max length, if desired
        NRF_LOG_DEBUG("Read in settings: Variable packet len");
    }
    else
    {
        NRF_LOG_ERROR("Read in settings: UNSUPPORTED packet len config %d", pSettings->packetLenCfg);
    }
    pSettings->readFromChip = false;
}

static void readLQIandRSSI(packetRxSettings_t* pSettings, uint8_t numFifoBytes)
{
    cc1101_readSingleByte(RXFIFO_REGADDR, &pSettings->LQI);
    cc1101_readSingleByte(RXFIFO_REGADDR, (uint8_t*)&pSettings->RSSI);
    NRF_LOG_DEBUG("Read LQI %d, RSSI %d", pSettings->LQI, pSettings->RSSI);
    pSettings->rxState = packetRxState_finishedWithPacket;
}

static void readPacketBytes(packetRxSettings_t* pSettings, uint8_t numFifoBytes)
{
    uint32_t numExpected = pSettings->expectedPacketLen - pSettings->packetBufIndex;
    if (numFifoBytes < numExpected)
    { // If bytes are still coming in, don't empty the FIFO completely (section 20)
        cc1101_readBurst(RXFIFO_REGADDR, &pSettings->pPacket[pSettings->packetBufIndex], numFifoBytes - 1);
        pSettings->rxState = packetRxState_awaitingPacketBytes;
        pSettings->packetBufIndex += numFifoBytes - 1;
        NRF_LOG_INFO("fixedLen read %d of expected %d bytes, try again later", pSettings->packetBufIndex,
                     pSettings->expectedPacketLen);
    }
    else
    { // We have the bytes we need for a full packet, read them out, report done
        cc1101_readBurst(RXFIFO_REGADDR, &pSettings->pPacket[pSettings->packetBufIndex], numExpected);
        numFifoBytes -= numExpected;
        pSettings->packetBufIndex += numExpected;
        pSettings->rxState = packetRxState_receivedPacketBytes;
        NRF_LOG_INFO("Read fixed length packet of %d bytes, done.", pSettings->packetBufIndex);
        if (pSettings->RSSIandLQIAppended)
        { // If we should read LQI and RSSI, try and read those
            if (2 <= numFifoBytes)
            {
                readLQIandRSSI(pSettings, numFifoBytes);
            }
            else
            { // Wait til next poll
                pSettings->rxState = packetRxState_awaitingRSSILQI;
            }
        }
    }
}

static void readVariablePacket(packetRxSettings_t* pSettings, uint8_t numFifoBytes)
{
    if (packetRxState_awaitingPacketStart == pSettings->rxState)
    { // We need to read the first byte to know the length
        cc1101_readSingleByte(RXFIFO_REGADDR, &pSettings->expectedPacketLen); // First byte is length byte
        pSettings->rxState = packetRxState_awaitingPacketBytes;
        // Now see if we have enough bytes to receive the rest
        numFifoBytes--;
        if (numFifoBytes)
        {
            readPacketBytes(pSettings, numFifoBytes);
        }
    }
    else if (packetRxState_awaitingPacketBytes == pSettings->rxState)
    { // If awaiting packet bytes, read them
        readPacketBytes(pSettings, numFifoBytes);
    }
    else
    {
        NRF_LOG_ERROR("Stuck, ??");
    }
}

