colzin/nrf52_wheelLine_accel/nRF52_wheelLine_accel_SDK17/wheelLineRemote_FW/src/cc1101.c
static void tryReceivePacket(packetRxSettings_t* pSettings)
{
    uint8_t regByte;
    if (NULL == pSettings)
    {
        return;
    }
    if (pSettings->readFromChip)
    {
        readInSettings(pSettings);
    }
    // Read RXBYTES to see if there are any bytes
    cc1101_readSingleByte(RXBYTES_REGADDR, &regByte);
    if (regByte & RXBYTES_OVERFLOW)
    {
        NRF_LOG_WARNING("Rx OVERFLOW, flushing and going back to RX!");
        cc1101_strobe(STROBE_FLUSHRXFIFO);
        cc1101_strobe(STROBE_SRX);
        pSettings->rxState = packetRxState_awaitingPacketStart;
        pSettings->packetBufIndex = 0;
        return;
    }
    uint8_t numFifoBytes = RXBYTES_NUM(regByte);
    if (!numFifoBytes)
    { // No bytes to read
        return;
    }
    // If here, we have bytes to read in RX FIFO
    NRF_LOG_INFO("have %d bytes in RXFIFO", numFifoBytes);
    switch (pSettings->packetLenCfg)
    {
        case pktLen_fixed:
            readPacketBytes(pSettings, numFifoBytes);
        break;
        case pktLen_variable:
            readVariablePacket(pSettings, numFifoBytes);
        break;
        default:
            NRF_LOG_ERROR("Packet type %d not handled yet", pSettings->packetLenCfg)
            ;
        break;
    }
}

static void sendTestPacket(void)
{
    uint8_t bytes[TEST_PKT_LEN];
    for (uint32_t i = 0; i < TEST_PKT_LEN; i++)
    {
        bytes[i] = (uint8_t)i;
    }
    cc1101_writeBurst(TXFIFO_REGADDR, bytes, TEST_PKT_LEN);
    cc1101_readSingleByte(TXBYTES_REGADDR, bytes);
    NRF_LOG_DEBUG("Wrote %d bytes to txfifo, TXYBTES says %d", TEST_PKT_LEN, bytes[0]);
    cc1101_strobe(STROBE_STX);
}

static void cc1101Poll(void)
{
    if (uptimeCounter_elapsedSince(m_lastRxPoll_ms) >= RX_POLL_ITVL_MS)
    {
        cc1101_strobe(STROBE_NOP);
        switch (CHIPSTATUSBYTE_STATE(m_lastChipStatusByte))
        {
            case statusByteState_tx:
                // If in TX state
#if TX_TEST_ITVL_MS
                if (uptimeCounter_elapsedSince(m_lastTx_ms) > 1000)
                #endif // #if TX_TEST_ITVL_MS
            {
                NRF_LOG_WARNING("timed out in TX, switch to RX");
                cc1101_strobe(STROBE_SRX);
            }
            break;
            case statusByteState_rx:
                // If in receiving state
//                NRF_LOG_DEBUG("Check for RX bytes")
//                ;
                tryReceivePacket(&m_rxSettings);
            break;
            case statusByteState_idle:
                NRF_LOG_DEBUG("move from idle to RX:")
                ;
                cc1101_strobe(STROBE_SRX);
            break;
            case statusByteState_rxOverflow:
                NRF_LOG_ERROR("Detected RX overflow, flushing and idling")
                ;
                cc1101_setIdle(true);
            break;
            case statusByteState_txUnderflow:
                NRF_LOG_ERROR("Detected TX underflow, flushing and idling")
                ;
                cc1101_setIdle(true);
            break;
            default:
                NRF_LOG_WARNING("State 0x%x", CHIPSTATUSBYTE_STATE(m_lastChipStatusByte))
                ;
            break;
        }
        m_lastRxPoll_ms = uptimeCounter_getUptimeMs();
    }

#if TX_TEST_ITVL_MS
    if (uptimeCounter_elapsedSince(m_lastTx_ms) >= TX_TEST_ITVL_MS)
    {
        // TODO run a TX packet
        sendTestPacket();
        m_lastTx_ms = uptimeCounter_getUptimeMs();
    }
#endif // #if TX_TEST_ITVL_MS
}

void cc1101_init(void)
{
    spi0_init(); // Make sure pins are muxed and working
    m_lastChipStatusByte = 0xFF;
    bool testPass = cc1101_reboot();
    if (!testPass)
    {
        NRF_LOG_ERROR("Couldn't reboot CC1101");
        return;
    }
    testPass = cc1101_selfTest();
    if (!testPass)
    {
        NRF_LOG_ERROR("CC1101 self-test failed");
        return;
    }
// If here, init it
//    cc1101_initASKTx_myStudio();
    setupFeb6(); // TODO figure out optimal parameters

    m_rxSettings.pPacket = m_rxPacketBuffer;
    m_rxSettings.readFromChip = true;
    m_rxSettings.packetBufIndex = 0;
    m_rxSettings.packetBufLen = sizeof(m_rxPacketBuffer);
    m_rxSettings.rxState = packetRxState_awaitingPacketStart;

    pollers_registerPoller(cc1101Poll);
// Start by going to idle
    cc1101_setIdle(true);
}
